Autodesk.Revit.DB.BuiltInFailures.LoadFailures.PointBCNotOverlappingHost
Point BC is not overlapping with its entire distribution its host.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.LineBCNotOverlappingHost
Line BC is not overlapping with its entire distribution its host.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.InvalidLineLoadForceDistribution
A line load cannot have forces distributed on both sides of the analytical element. Please review the line load force parameters and try again.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.InvalidAreaLoadForceDistribution
An area load cannot have forces distributed on both sides of the analytical panel. Please review the area load force parameters or the positions of the reference points and try again.

Autodesk.Revit.DB.BuiltInFailures.LoadFailures.AreaBCNotOverlappingHost
Area BC is not overlapping with its entire distribution its host.